export const DefinedData = [
  {
    id: 0,
    title: "원활한 팀플레이와 소통이 가능합니다.",
    content1:
      "팀 프로젝트를 진행할 때 매일 2번 스탠드 업 미팅 시간을 가지며, 프로젝트 업무의 진척도와 문제 사항을 공유했습니다.",
    content2:
      "팀 프로젝트에서 완벽한 계획보다는 팀원들 간의 소통을 통해 핵심 기능을 우선순위로 개발하고, 빠르게 배포하였습니다. 배포 후 문제가 있으면 다시 개발하는 방식을 사용했습니다.",
  },
  {
    id: 1,
    title: "해결하기 어려운 문제 앞에서 설레는 사람입니다.",
    content1:
      "팀 프로젝트를 진행할 때 다른 팀원이 해결하지 못하는 문제가 있었습니다. 그때, 같이 고민하다가 문제를 해결했고, 성취감을 느꼈습니다. 그 이후로 풀리지 않는 문제를 만나면 해결할 생각에 설렙니다.",
  },
  {
    id: 2,
    title: "공부한 내용을 정리하여 기록합니다.",
    content1:
      "블로그를 운영하는 주된 이유는 공부하느라 투자한 시간과 노력이 헛되지 않게 하기 위해서입니다. 정리되지 않은 학습 내용은 금방 사라지기 때문에 기록으로 남기려고 노력합니다.",
    content2: "https://velog.io/@developer09",
  },
];
